Sonair-AS/rust_stm32h7xx-hal/src/lib.rs
//! *See the [examples](https://github.com/stm32-rs/stm32h7xx-hal/tree/master/examples) folder for more usage examples*
//!
//! This Hardware Abstraction Layer (HAL) provides the following functionality:
//!
//! Setup and Configuration
//!
//! * [Power Configuration](crate::pwr)
//! * [Reset and Clock Control](crate::rcc)
//!
//! Digital IO
//!
//! * [General Purpose Input / Output](crate::gpio)
//! * [External interrupt controller](crate::exti)
//!
//! Analog IO
//!
//! * [Analog to Digital Converter (ADC)](crate::adc)
//! * [Digital to Analog Converter (DAC)](crate::dac)
//!
//! Digital Busses
//!
//! * [Inter Integrated Circuit (I2C)](crate::i2c)
//! * [Serial Peripheral Interface (SPI)](crate::spi)
//! * [Serial Data (USART/UART)](crate::serial)
//! * [Serial Audio Interface](crate::sai)
//! * [Quad or Octo SPI](crate::xspi) Feature gate `xspi`
//! * [Ethernet](crate::ethernet) Feature gate `ethernet`
//! * [USB HS](crate::usb_hs) Feature gate `usb_hs`
//! * [LCD-TFT Display Controller](crate::ltdc) Feature gate `ltdc`
//! * MIPI DSI (STM32H747/757 only) Feature gate `dsi`
//! * [CAN and CAN-FD](crate::can) Feature gate `can`
//!
//! External Memory
//!
//! * [Flexible Memory Controller (FMC)](crate::fmc) Feature gate `fmc`
//! * [SD Card (SDMMC)](crate::sdmmc) Feature gate `sdmmc` (FAT16/32 driver is available under the `sdmmc-fatfs` feature gate)
//!
//! Timing functions
//!
//! * [Pulse Width Modulation (PWM)](crate::pwm)
//! * [Quadrature Encoder Interface](crate::qei)
//! * [Real-Time Clock](crate::rtc) Feature gate `rtc`
//! * [Timers](crate::timer)
//! * [Delays](crate::delay)
//!
//! Others
//!
//! * [Direct Memory Access (DMA)](crate::dma)
//! * [Cyclic Redundancy Check (CRC)](crate::crc) Feature gate `crc`
//! * [Random Number Generator](crate::rng) ([rand_core::RngCore] is implemented under the `rand` feature gate)
//! * [Embedded Flash Memory](crate::flash)
//! * [System Window Watchdog](crate::system_watchdog)
//! * [Independent Watchdog](crate::independent_watchdog)
//!
//! Cargo Features
//!
//! * [`defmt`](https://defmt.ferrous-systems.com/) formatting for some types can be enabled with the feature `defmt`.

#![cfg_attr(not(test), no_std)]
#![cfg_attr(docsrs, feature(doc_cfg))]
#![allow(non_camel_case_types)]

extern crate paste;

#[cfg(not(feature = "device-selected"))]
compile_error!(
    "This crate requires one of the following device features enabled:
        stm32h742
        stm32h743
        stm32h753
        stm32h750
        stm32h742v
        stm32h743v
        stm32h753v
        stm32h750v
        stm32h747cm7
        stm32h757cm7
        stm32h7b3
        stm32h7b0
        stm32h7a3
        stm32h735
"
);

pub use embedded_hal as hal;
pub mod traits;

pub use nb;
pub use nb::block;

// Single core
#[cfg(any(
    feature = "stm32h742",
    feature = "stm32h743",
    feature = "stm32h750",
))]
pub use stm32h7::stm32h743 as stm32;
#[cfg(any(
    feature = "stm32h742v",
    feature = "stm32h743v",
    feature = "stm32h750v",
))]
pub use stm32h7::stm32h743v as stm32;

// Single core with crypto
#[cfg(feature = "stm32h753")]
pub use stm32h7::stm32h753 as stm32;
#[cfg(feature = "stm32h753v")]
pub use stm32h7::stm32h753v as stm32;

// Dual core
#[cfg(feature = "stm32h747cm7")]
pub use stm32h7::stm32h747cm7 as stm32;
//#[cfg(feature = "stm32h757cm7")]
//pub use stm32h7::stm32h757cm7 as stm32;
// TODO(rm0399): soundness of PeripheralREC macro in rcc/rec.rs

// High Memory Integration
#[cfg(any(
    feature = "stm32h7b3",
    feature = "stm32h7a3",
    feature = "stm32h7b0",
))]
pub use stm32h7::stm32h7b3 as stm32;

// High Speed
#[cfg(feature = "stm32h735")]
pub use stm32h7::stm32h735 as stm32;

#[cfg(all(feature = "rm0433", feature = "rm0399"))]
compile_error!("Cannot not select both rm0433 and rm0399");

#[cfg(all(feature = "cm7", feature = "cm4"))]
compile_error!("Cannot not select both CM7 and CM4");

#[cfg(feature = "device-selected")]
pub use crate::stm32 as pac;
#[cfg(feature = "device-selected")]
pub use crate::stm32 as device;

// Enable use of interrupt macro
#[cfg(feature = "rt")]
#[cfg_attr(docsrs, doc(cfg(feature = "rt")))]
pub use crate::stm32::interrupt;

#[cfg(all(feature = "device-selected", feature = "adc"))]
pub mod adc;
#[cfg(all(feature = "device-selected", feature = "can"))]
#[cfg_attr(docsrs, doc(cfg(feature = "can")))]
pub mod can;
#[cfg(all(feature = "device-selected", feature = "crc"))]
#[cfg_attr(docsrs, doc(cfg(feature = "crc")))]
pub mod crc;
#[cfg(all(feature = "device-selected", feature = "dac"))]
pub mod dac;
#[cfg(all(feature = "device-selected", feature = "delay"))]
pub mod delay;
#[cfg(all(feature = "device-selected", feature = "dma"))]
pub mod dma;
#[cfg(all(feature = "device-selected", feature = "dsi", feature = "rm0399"))]
pub mod dsi;
#[cfg(all(
    feature = "device-selected",
    feature = "ethernet",
    not(feature = "rm0455")
))]
#[cfg_attr(docsrs, doc(cfg(feature = "ethernet")))]
pub mod ethernet;
#[cfg(all(feature = "device-selected", feature = "exti"))]
pub mod exti;
#[cfg(all(feature = "device-selected", feature = "flash"))]
pub mod flash;
#[cfg(all(feature = "device-selected", feature = "fmc"))]
#[cfg_attr(docsrs, doc(cfg(feature = "fmc")))]
pub mod fmc;
#[cfg(all(feature = "device-selected", feature = "gpio"))]
pub mod gpio;
#[cfg(all(feature = "device-selected", feature = "i2c"))]
pub mod i2c;
#[cfg(all(feature = "device-selected", feature = "independent_watchdog"))]
pub mod independent_watchdog;
#[cfg(all(feature = "device-selected", feature = "ltdc"))]
#[cfg_attr(docsrs, doc(cfg(feature = "ltdc")))]
pub mod ltdc;
#[cfg(feature = "device-selected")]
pub mod prelude;
#[cfg(all(feature = "device-selected", feature = "pwm"))]
pub mod pwm;
#[cfg(feature = "device-selected")]
pub mod pwr;
#[cfg(all(feature = "device-selected", feature = "qei"))]
pub mod qei;
#[cfg(feature = "device-selected")]
pub mod rcc;
#[cfg(all(feature = "device-selected", feature = "rng"))]
pub mod rng;
#[cfg(all(feature = "device-selected", feature = "rtc"))]
#[cfg_attr(docsrs, doc(cfg(feature = "rtc")))]
pub mod rtc;
#[cfg(all(feature = "device-selected", feature = "sai"))]
pub mod sai;
#[cfg(all(feature = "device-selected", feature = "sdmmc"))]
#[cfg_attr(docsrs, doc(cfg(feature = "sdmmc")))]
pub mod sdmmc;
#[cfg(all(feature = "device-selected", feature = "serial"))]
pub mod serial;
#[cfg(all(feature = "device-selected", feature = "signature"))]
pub mod signature;
#[cfg(all(feature = "device-selected", feature = "spi"))]
pub mod spi;
#[cfg(all(feature = "device-selected", feature = "system_watchdog"))]
pub mod system_watchdog;
#[cfg(feature = "device-selected")]
pub mod time;
#[cfg(all(feature = "device-selected", feature = "timer"))]
pub mod timer;
#[cfg(all(feature = "device-selected", feature = "usb_hs"))]
#[cfg_attr(docsrs, doc(cfg(feature = "usb_hs")))]
pub mod usb_hs;
#[cfg(all(feature = "device-selected", feature = "xspi"))]
#[cfg_attr(docsrs, doc(cfg(feature = "xspi")))]
pub mod xspi;

#[cfg(feature = "device-selected")]
#[allow(unused)]
mod sealed {
    pub trait Sealed {}
}
#[cfg(feature = "device-selected")]
#[allow(unused)]
pub(crate) use sealed::Sealed;

#[cfg(not(feature = "certified_subset"))]
#[allow(unused)]
fn stripped_type_name<T>() -> &'static str {
    let s = core::any::type_name::<T>();
    let p = s.split("::");
    p.last().unwrap()
}
